CompositeApp1/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sin="http://j2ee.netbeans.org/wsdl/sinAplusB">
  <soapenv:Body>
    <sin:sinAplusBOperation>
      <partA>45</partA>
      <partB>45</partB>
    </sin:sinAplusBOperation>
  </soapenv:Body>
</soapenv:Envelope>